Revit 2024 API
BuiltInFailures.WallFailures.InvalidTopConstraintForLevel Property
 Top Constraint is invalid for the Level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidTopConstraintForLevel { get; }
Visual Basic
Public Shared ReadOnly Property InvalidTopConstraintForLevel As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidTopConstraintForLevel {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace